{
    "array": {
        "filter": {
            "desc": ""
        },
        "foreach": {
            "desc": ""
        },
        "get": {
            "desc": "Obtiene un elemento de una matriz en la posición `index`."
        },
        "isarray": {
            "desc": "Devuelve true si el elemento proporcionado es un array y false en caso contrario. No puedes utilizar nombres de variables."
        },
        "join": {
            "desc": "Se une a una matriz con el `delimiter` proveido."
        },
        "length": {
            "desc": "Devuelve la longitud de la matriz proporcionada."
        },
        "map": {
            "desc": ""
        },
        "pop": {
            "desc": "Elimina y luego devuelve el último elemento de la matriz."
        },
        "push": {
            "desc": "Lleva un elemento al final de una matriz. Devuelve la matriz modificada."
        },
        "set": {
            "desc": "Establece un elemento en el array en el `index` especificado."
        },
        "shift": {
            "desc": "Elimina y devuelve el primer elemento de la matriz."
        },
        "slice": {
            "desc": "Devuelve una sección de la matriz, incluyendo el índice de 'Inicio' y excluyendo el índice de 'fin'. Si 'end' no está especificado, establece valor por defecto a todos los elementos restantes."
        },
        "sort": {
            "desc": ""
        },
        "splice": {
            "desc": "A partir de la posición 'Inicio', quita los elementos 'deleteCount' de la matriz y agrega el resto de los 'items' en esa posición. Devuelve los elementos quitados."
        },
        "split": {
            "desc": "Divide el 'texto' por el `delimiter`, volviendo a la nueva matriz."
        },
        "unshift": {
            "desc": "Inserta 'value' al principio del array y devuelve la matriz modificada."
        }
    },
    "channel": {
        "id": {
            "desc": "Devuelve el ID del canal actual o especificado."
        },
        "nsfw": {
            "desc": "Devuelve si el canal actual o especificado es NSFW."
        },
        "name": {
            "desc": "Retorna el nombre del canal actual o especificado."
        },
        "position": {
            "desc": "Devuelve la posición del canal actual o especificado."
        },
        "topic": {
            "desc": "Devuelve el tema del canal actual o especificado (sólo texto)."
        },
        "type": {
            "desc": "Devuelve el tipo de canal actual o especificado (devuelve \"texto\" o \"voz\")."
        }
    },
    "general": {
        "clean": {
            "desc": "Limpia el texto proporcionado reduciendo los espacios en blanco."
        },
        "comment": {
            "desc": "Especifica un área que se omitirá en el analisis"
        },
        "get": {
            "desc": "Devuelve la variable almacenada con el nombre proporcionado. Los prefijos de variable pueden modificar la piscina en la que buscan."
        },
        "set": {
            "desc": "Define la variable almacenada con el nombre proporcionado y con el valor proporcionado. Prefijos de variable pueden modificar la piscina en la que se establece."
        },
        "trim": {
            "desc": "Elimina espacios en blanco antes y después del texto proporcionado. Considere el uso de la etiqueta de {clean} para eliminar espacios en blanco en el texto."
        },
        "void": {
            "desc": "Evita la salida de dentro de la subetiqueta. Varia entre comentarios a medida que son analizadas las cosas, simplemente no aparece."
        },
        "newline": {
            "desc": "Devuelve el número especificado de nuevas lineas, estableciendo 1."
        },
        "space": {
            "desc": "Devuelve el número especificado de espacios, estableciendo por defecto 1."
        },
        "json": {
            "desc": ""
        }
    },
    "guild": {
        "createdat": {
            "desc": "Devuelve cuando se creó el gremio actual como un timestamp de Unix (en milisegundos)."
        },
        "channels": {
            "desc": "Devuelve los canales del gremio actual como una matriz."
        },
        "icon": {
            "desc": "Devuelve la dirección de enlace del icono del gremio actual."
        },
        "id": {
            "desc": "Devuelve el identificador del gremio actual."
        },
        "name": {
            "desc": "Devuelve el nombre del gremio actual."
        },
        "owner": {
            "desc": "Devuelve el ID de propietario del gremio."
        },
        "region": {
            "desc": "Devuelve la región en la que el gremio actual está."
        },
        "roles": {
            "desc": "Devuelve una matriz de roles del gremio actual."
        }
    },
    "logic": {
        "if": {
            "desc": "Si el `value` es igual a `true` o `1`, ejecutar`then`.\nSi el `value`es igual a `false` o `0`, ejecutar `else`.\nDe otro modo, produce un error.\n\nUsa esto con la etiqueta {logic}."
        },
        "logic": {
            "desc": "Lo operadores logicos en el `augend` y `operands`, devuelven `true` o `false`.\n\nEquivalencia de Operadores:\n - `==` - equivalente\n - `!=` - no equivalente\n - `<` - menor que\n - `<=` - menor o igual que\n - `>` - mayor que\n - `>=` - mayor o igual que\n - `startswith` - el sumando empieza con el operador\n - `endswith` - el sumando termina con el operador\n - `includes` - el sumando incluye el operador\n\nOperadores logicos:\n - `&&` - devuelve verdadero si el sumando y el operador son ambos verdaderos\n - `||` - devuelve verdadero si el sumando o el operador son alguno verdadero\n - `XOR` - devuelve verdadero si solo uno de ambos es verdadero (no ambos)\n\nOtros Operadores:\n - `!` - Invierte el siguiente operador (verdadero se vuelve falso, etc.)"
        }
    },
    "math": {
        "abs": {
            "desc": "Devuelve el valor absoluto del número proporcionado (no negativo)."
        },
        "base": {
            "desc": "Analiza el `number` usando la base 'origin' proporcionada (estableciendo 10) y lo convierte en la base 'radix'."
        },
        "ceil": {
            "desc": "Redondea el decimal proveido hacia arriba."
        },
        "floor": {
            "desc": "Redondea los decimales proveidos hacia abajo."
        },
        "math": {
            "desc": "Calcula el valor de la expresión proporcionada usando los siguientes operadores:\n\n - `**` - exponentes\n - `/` - división\n - `*` - multiplicacion\n - `+` - adicion\n - `-` - sustracion\n - `&` - operador lógico Y\n - `|` - operador lógico O\n - `^` - operador lógico NOR\n\n\nLos operadores son ejecutados usando la Orden de Operaciones (Brackets, Exponentes, División, Multiplicación, Adición, Sustración, Operador Logico).\n\nSi un operador no es especificado, se usa el ultimo operador usado (por defecto adición).\n\nLos brackets se lograrian usando otra etiqueta {math} añadida.\n\nSi un `operand` o `augend` no puede ser pasado como un numero, una variable con el mismo nombre será regresada. Si la variable regresada tampoco es un numero, arroja un error."
        },
        "parsefloat": {
            "desc": "Trata de analizar el texto como un decimal."
        },
        "parseint": {
            "desc": "Trata de analizar el texto como un entero."
        },
        "randint": {
            "desc": "Devuelve un entero aleatorio entre el rango proporcionado. 'min' va por defecto a '0'"
        },
        "round": {
            "desc": "Redondea `number' dado a los `places` decimales especificados', estableciendo a 0."
        }
    },
    "message": {
        "id": {
            "desc": "Devuelve el ID del mensaje de comando en ejecución."
        }
    },
    "role": {
        "color": {
            "desc": "Devuelve el color del rol especificado en hexadecimal."
        },
        "id": {
            "desc": "Devuelve el ID del rol especificado."
        },
        "mention": {
            "desc": "Devuelve la mención de la función especificada."
        },
        "name": {
            "desc": "Devuelve el nombre del rol especificado."
        },
        "position": {
            "desc": "Retorna la posición de la función especificada."
        }
    },
    "user": {
        "avatar": {
            "desc": "Devuelve la direccion de enlace del avatar del usuario especificado, estableciendo el usuario en ejecución."
        },
        "createdat": {
            "desc": "Devuelve la fecha en que el usuario especificado, estableciendo el usuario en ejecución, fue creado como un timestamp de Unix (en milisegundos)."
        },
        "discrim": {
            "desc": "Devuelve el discriminador del usuario especificado, estableciendo al usuario en ejecución."
        },
        "fullname": {
            "desc": "Devuelve el nombre + discriminador del usuario especificado, estableciendo al usuario en ejecución."
        },
        "game": {
            "desc": "Devuelve el juego que el usuario especificado está jugando, estableciendo el usuario en ejecución. Si el usuario no esta jugando, devuelve nothing."
        },
        "id": {
            "desc": "Devuelve el identificador de usuario especificado, estableciendo al usuario en ejecución."
        },
        "joinedat": {
            "desc": "Devuelve la fecha en que el usuario especificado, estableciendo el usuario en ejecución, se unió al gremio actual como un timestamp de Unix (milisegundos)."
        },
        "mention": {
            "desc": "Menciona al usuario especificado, estableciendo al usuario en ejecución."
        },
        "name": {
            "desc": "Devuelve el nombre del usuario especificado, estableciendo al usuario en ejecución."
        },
        "nick": {
            "desc": "Devuelve el apodo del usuario especificado, estableciendo al usuario en ejecución."
        },
        "roles": {
            "desc": "Devuelve una matriz de los roles que tiene el usuario especificado, estableciendo al usuario en ejecución."
        },
        "setnick": {
            "desc": "Establece el apodo del usuario especificado, estableciendo al usuario en ejecución."
        },
        "status": {
            "desc": "Devuelve el estado del usuario especificado, estableciendo al usuario en ejecución. Puede devolver \"en línea\", \"away\", \"dnd\" o \"offline\"."
        }
    }
}