{
    "language": "Ingles",
    "header": {
        "login": "Iniciar Sesion",
        "logout": "Salir",
        "commands": "Comandos",
        "bbtag": "Etiqueta BB",
        "subtags": "Seub Etiqeutas",
        "dashboard": "Panel de Control"
    },
    "generic": {
        "loading": "Cargando",
        "collapse": "Contraer Todo",
        "expand": "Expandir Todo",
        "search": "Filtro...",
        "noresults": "¡Oh no! No se encontraron resultados.",
        "resultsfound": "Resultados Coincidientes:"
    },
    "index": {
        "desc": "blargbot is un bot de Discord mulproposito dedicado a proporcionar comandos y servicios de calidad, incluyendo registros de cha y un sistema de comandos profundo personalizado.",
        "commands": {
            "title": "Comandos",
            "desc": "blargbot está equipado con numerosos comandos, todos los cuales son documentados y categorizados para su comodidad."
        },
        "bbtag": {
            "title": "Etiqueta BB",
            "desc": "blargbot usa un sistema de etiquetas sofisticado llamado Etiquetas BB, que se puede utilizar para crear comandos avanzados personalizados."
        },
        "customization": {
            "title": "Personalización",
            "desc": "Entendemos que cada gremio no es el mismo, por lo que blargbot tiene una basta personalización. Usted puede controlar exactamente qué funciones pueden utilizar los comandos, especificar prefijos personalizados e incluso cambiar el idioma de la pantalla!"
        },
        "moderation": {
            "title": "Moderación",
            "desc": "Need something to moderate your chat? blargbot is equiped with many moderation utilities, from basic operations like banning and muting, to more advanced stuff like chatlogging or automatic censoring."
        },
        "opensource": {
            "title": "Codigo-Abierto",
            "desc": "¡Compartir es cuidar! blargbot es completamente de codigo abierto bajo licencia GNU AGPLv3. No dudes en echar un vistazo y aprender cómo funciona. Si utilizas cualquiera de mi código en tu propio proyecto, requeriras de mi credito. Ver la licencia para más detalles."
        },
        "suggestions": {
            "title": "Abierto a Sugerencias",
            "desc": "¿Tiene alguna sugerencia para el bot? ¡Estaría encantado de escucharla! ¿Encontraste un error? ¡Me gustaría también! Puedes sugerirme cualquier cosa usando el comando 'sugerir', uniéndose a mi gremio, o mediante la presentación de un ticket."
        }
    },
    "bbtag": {
        "main": "# EtiquetaBB\n> ¡No debe ser confundido con CodigoBB!\n\nEtiquetaBB es unlenguaje de programacion basado en plantillas, diseñado para proveer un marco de gran alcance paa crea comandos avanzados personalizados.\n\n### Terminologia\n\n- Una `etiqueta` se refiere a un bloque de codigo EtiquetaBB, bien sea una etiqueta publica o un comando personalizado.\n-Una `sub etiqueta` se refiere a un componente EtiquetaBB. Las `etiquetas` avanzadas son hechas de muchas `sub etiquetas`.\n- Una `clase` se refiere a un grupo de `sub etiquetas`.",
        "subtags": {
            "title": "Sub Etiquetas",
            "desc": "## SubEtiquetas\n\nLas subetiquetas son el bloque de construcción básico de BBtag. Ellas emplean funciones dinámicas, ya sea obteniendo el nombre de un usuario o haciendo cálculos. Echemos un vistazo ahora a una subetiqueta:\n```\n{math.randint;1;10}\n```\nAl ejecutarse, esto devolverá algo asi:\n```\n6\n```\nComo puedes ver, la subetiqueta `math.randint`devuelve un entero aleatorio entre el rango dado.\n\n### Anatomia de una SubEtiqueta\n\nUna subetiqueta esta hecha de varios componentes. Un diagrama de sintaxis puede verse algo así:\n```\n{[class.]name[![var]]([;args]...|=<namedArgs>...}\n```\nOh vaya, esta bien. Eso es un poco confuso,  ¡pero ten paciencia conmigo!\n\n#### Clases\n\n> `[class.]name`\n\nLas subetiquetas se dividen en dos grupos, llamadas **clases**. Cada clase tiene designado un propósito especifico. Por ejemplo, la clase `math` contiene subetiquetas que manejan números. Del mismo modo, la clase `user` contiene subetiquetas que dan información sobre los usuarios. Las clasees brindan un sistema de organización. \n\nCuando se usa una subetiqueta el uso ideal seria `{class.name}`. Esto mejora la legibilidad. Sin embargo, el declarar la clase explicitamente usualmente es opcional. BBtags sabe que `{math.randint}` y `{randint}` son la misma subetiqueta. Esto es llamado **clases implícitas**. La excepción a esto son las subetiquetas en la clase `general`, las cuales deberían ser usadas **sin** una clase exlpicita.\n\n¡Sin embargo, deberias tener cuidado con las clases implícitas! Algunas veces, las clases pueden tener subetiquetas con el mismo nombre. Por ejemplo,  `{user.id}` y`{channel.id}` ambas tienen subetiquetas con el nombre `id`. Si intentas usar clases implicitas con una subetiqueta que existe en multiples clases, ¡devolverá un error!\n\n#### Conductos\n\n> `[![var]]`\n\nLos conductos son una característica que permite redireccionar  la salida  de una subetiqueta, bien sea a una variable o a nulo. Esto puede ayudar a limpiar tu código.\n\nPor ejemplo, si por cualquier razon no quieres que una subetiqueta arroje nada, puedes añadir un `!` despues del nombre de la subetiqueta para silenciarla. Las siguientes lineas son equivalentes:\n```\n{void;{math.randint;1;10}}\n{math.randint!;1;10}\n```\nSi quieres almacenar la salida de las subetiquetas en una variable, puedes añadir `!variableName` después del nombre de la subetiqueta. Las siguientes lineas son equivalentes:\n```\n{set;randomInteger;{math.randint;1;10}}\n{math.randint!randomInteger;1;10}\n```\nConducir una salida es ligeramente mas rapido de ejecutar que usar la sintaxis completa.\n\n#### Argumentos\n\n> `[;args]...`\n\nPuedes pasar los parámetros a subetiquetas. Estos son separados por punto y coma `;`. Los argumentos son diferentes a las pre-subetiquetas, y puedes encontrar documentación sobre ellos en la pagina de subetiquetas.\n\n#### Argumentos Nombrados\n\n> `=<namedArgs>...`\n\nNormalmente, el orden de argumentos proveídos es muy importante. Sin embargo, puedes usar en su lugar contrapartes nombradas. Esto se hace usando el token `=` en vez del punto y coma, y luego especificando las etiquetas key-value, en el formato de `{*key;value}`.\n\nPor ejemplo, el uso de `{math.randint}` es `{math.randint;min;max}`. Los nombres del argumento son `min` y `max` respectivamente. Los siguientes usos son equivalentes:\n```\n{math.randint;1;10}\n{math.randint=\n    {*min;1}\n    {*max;10}\n}\n```\nNo puedes usar ambos argumentos nombrados y argumentos ordenados en la misma subetiqueta."
        },
        "variables": {
            "title": "Variables",
            "desc": ""
        },
        "arrays": {
            "title": "Matrices",
            "desc": "## Matrices\n\nLas matrices son una estructura de datos muy útil. En esencia, una matriz es una lista de elementos. Son usados de forma similar a las subetiquetas, con corchetes `[]` en vez de llaves `{}`.\n\nHay muchas subetiquetas dedicadas a usar y manipular matrices. Mira la clase `Array` para mas detalles.\n\n### Sintaxis\n> `[item;item;item]`\n\n### Indices\n\nLas matrices con ordenadas. Cada elemento en una matriz es asignada a un **indice**, el cual básicamente es la posición del elemento en la matriz.\n\nLo mas importante a saber sobre las matrices es que son **0-indexadas**. Esto significa que los indices empiezan en 0 en vez de 1. Echemos un vistazo a esta muestra de matriz:\n```\n Indice:  0 1 2 3 4\n-------------------\nValores: [1;2;3;4;5]\n```\nEl primer elemento, `1`, tiene un indice de `0`. Del mismo modo, el cuarto elemento `4` tiene un indice de `3`. A primeras esto puede parecer engañoso, pero es simple una vez que te acostumbras."
        }
    },
    "subtags": {
        "components": {
            "argument": "Argumentos:",
            "named": "Soporta argumentos nombrados",
            "unnamed": "**No** soporta argumentos nombrados",
            "array": "Soporta matrices",
            "staff": "Requiere que el autor sea parte del personal",
            "noimplicit": "No permite clases implicitas"
        },
        "referdocs": "Consulte la [documentation](/bbtag) para más instrucciones de uso."
    },
    "commands": {
        "title": "Comandos",
        "desc": "blargbot está equipado con numerosos comandos. De forma predeterminada, blargbot responde a los prefijos 'b!', 'blargbot' y las menciones. Puede Agregar prefijos adicionales para usted y para los gremios. \n\nAlgunos comandos sólo pueden utilizarse por los miembros que se definen como parte del personal. También puede personalizar las restricciones de uso de cada comando individualmente.\n\nAlgunos comandos tienen requerimientos de permisos especiales para ser ejecutados, como subir las imágenes. Por favor, asegúrese de que el bot tenga los permisos adecuados cuando se intente utilizar un comando. \n\n## Argumentos \n- '<>' - denota un argumento requerido - \n'[]' - denota un argumento opcional - \n'...' - denota un argumento repetido \n\n### Banderas \n\nAlgunos comandos son capaces de tomar parámetros de línea de comandos tipo bandera. Todos los indicadores se dividen en códigos de bandera (con el prefijo '-') y palabras (con el prefijo--). Las banderas se pueden proporcionar en cualquier orden, pero deben ser después de las discusiones normales. \n\nPor ejemplo, si un comando tiene una entrada de usuario, puede usar '-u' o '--usuario '.\n\n''' b! comando--usuario @user #1234 \nb! comando -u @user #1234 ''' \n\n¡Usted también puede encadenar códigos de bandera juntos. Por ejemplo, '-prueba de bandera ' activar banderas '-f', '-l', '-una ' y dar el contenidos 'prueba' a '-g'.",
        "components": {
            "usage": "Uso:",
            "flags": "Banderas:",
            "aliases": "Alias:",
            "subcommands": "Subcomandos:"
        }
    },
    "dashboard": {
        "userheader": "Configuraciones de Usuario",
        "guildheader": "Configuraciones de Gremio",
        "notauthed": "### Lo sentimos, no puedes acceder a esta pagina.",
        "user": {
            "dmerrors": "Errores de mensaje directo"
        }
    }
}