{
    "language": "Norsk",
    "header": {
        "login": "Logg inn",
        "logout": "Logg ut",
        "commands": "Kommandoer",
        "bbtag": "BBTag",
        "subtags": "SubTags",
        "dashboard": "Dashbord"
    },
    "generic": {
        "loading": "Laster",
        "collapse": "Kollaps Alle",
        "expand": "Utvid Alle",
        "search": "Filter...",
        "noresults": "Uh oh! Fant ingen resultater.",
        "resultsfound": "Treff:"
    },
    "index": {
        "desc": "blargbot er en multifunksjonell Discord bot dedikert til å levere bra kommandoer og tjenester, i tillegg til chatlogs og et grundig egendefinert kommando system.",
        "commands": {
            "title": "Kommandoer",
            "desc": "blargbot er utstyrt med en haug av kommandoer, som alle er dokumentert og kategorisert for å gjøre det lettere for deg."
        },
        "bbtag": {
            "title": "BBTag",
            "desc": "blargbot bruker et sofistikert tag system kalt BBTag, som du kan bruke til å lage egne avanserte kommandoer."
        },
        "customization": {
            "title": "Tilpasning",
            "desc": "Vi er klar over at ikke alle servere er like, så blargbot har omfattende tilpasning. Du kan kontrollere nøyaktig hvilke roller som kan bruke hvilke kommandoer, sette egendefinerte prefikser og velge språket!"
        },
        "moderation": {
            "title": "Moderasjon",
            "desc": "Trenger du noen til å overvåke chatten din? blargbot er utstyrt med mange moderasjonsverktøy fra grunnleggende ting som å utestenge eller dempe en bruker, til mer avanserte ting som chatlogging eller automatisk sensur."
        },
        "opensource": {
            "title": "Open-Source",
            "desc": "Sharing is caring! blargbot er helt open-sorce under GNU AGPLv3 lisensen. Du er velkommen til å ta en titt og lære deg hvordan alt funker. Om du bruker noe av koden min i ditt eget prosjekt, er du forpliktet til å henvise til meg. Se lisensen for fler detaljer."
        },
        "suggestions": {
            "title": "Åpen For Forslag",
            "desc": "Har du et forslag til botten? Jeg vil gjerne høre det! Funnet en bug? Jeg vil gjerne høre det også! Du kan foreslå noe til meg ved bruk av `suggest` kommandoen, ved bli med i serveren min eller sende inn en tilbakemelding."
        }
    },
    "bbtag": {
        "main": "# BBTag\n> Må ikke forveksles med BBCode!\n\nBBTag er et mal-basert programmeringsspråk, utformet for å gi en kraftig ramme til å lage egne avanserte kommandoer.\n\n### Terminologi\n\n- En `tag` refererer til en blokk av BBTag kode, enten det er en offentlig tag eller en egendefinert kommando.\n- En `subtag` refererer til en BBTag komponent. Avanserte `tags` er bygd opp av mange `subtags`.\n- En `klasse` refererer til en gruppe av `subtags`.",
        "subtags": {
            "title": "SubTags",
            "desc": ""
        },
        "variables": {
            "title": "",
            "desc": ""
        },
        "arrays": {
            "title": "",
            "desc": ""
        }
    },
    "subtags": {
        "components": {
            "argument": "",
            "named": "",
            "unnamed": "",
            "array": "",
            "staff": "",
            "noimplicit": ""
        },
        "referdocs": ""
    },
    "commands": {
        "title": "",
        "desc": "",
        "components": {
            "usage": "",
            "flags": "",
            "aliases": "",
            "subcommands": ""
        }
    },
    "dashboard": {
        "userheader": "",
        "guildheader": "",
        "notauthed": "",
        "user": {
            "dmerrors": ""
        }
    }
}