{
    "array": {
        "filter": {
            "desc": "Umuulit sa isang array, habang tinatakda ang kasalukuyang element sa isang pansamantalang variable `i`. Kung ang `varName` ay nakatukoy, itatakda na lamang sa variable na iyon.\n\nMagbabalik ng bagong array na naglalaman lamang ng mga elemento kung saan ang resulta ng pag-ulit ay `true` o` 1`."
        },
        "foreach": {
            "desc": "Umuulit sa isang array, ang pansamantalang variable `i` ay tinatakda ang kasalukuyang element. Kung ang `varName` ay nakatukoy, itatakda na lamang sa variable na iyon."
        },
        "get": {
            "desc": "Kumukuha ng element galing sa array na nasa posisyon na `index`."
        },
        "isarray": {
            "desc": "Magbabalik ng true kung ang binigay na element ay nasa array, at false kung hindi. Hindi ka pwede gumamit ng variable names."
        },
        "join": {
            "desc": "Sumali sa talaan kasama sa naibigay na `delimiter`."
        },
        "length": {
            "desc": "Ibalik ang haba ng nasabing talaan."
        },
        "map": {
            "desc": "Umuulit sa isang array, habang tinatakda ang kasalukuyang element sa isang pansamantalang variable `i`. Kung ang `varName` ay nakatukoy, itatakda na lamang sa variable na iyon.\n\nMagbabalik ng bagong array kung saan ang mga element ay ang resulta ng paguulit."
        },
        "pop": {
            "desc": "Tangalin at ibalik ang huling elemento ng talaan."
        },
        "push": {
            "desc": "Itulak ang elemento sa huli ng talaan. Ibalik ang binagong talaan."
        },
        "set": {
            "desc": "Magtakda ng elemento sa talaan sa natukoy na `index`."
        },
        "shift": {
            "desc": "Tanggalin at ibalik ang unang elemento sa talaan."
        },
        "slice": {
            "desc": "Ibalik ang isang seksyon ng talaan, kasama ang `simula` ng index at hindi kasama ang `huli` huli ng index. Kung ang `end` ay hindi matukoy, ang lahat ng natitirang elemento ay i-default."
        },
        "sort": {
            "desc": "Inaayos at binabalik ang array, by default nasa pataas na order\n\nKung ang `function` ay ibinigay, ang pagaayos ay nakabase sa resulta pag isinagawa ang nasabing function. Ito ay magtatakda ng dalawang pansamantalang variable: `a` (o `varNameOne`) at `b` (o `varNameTwo`).\n\nAng function ay dapat magbalik ng numero. Kung ay numero ay mas malaki sa 0, ang `a` ay ituturing mas marami kaysa sa `b`. Kung ang numero ay mas mababa sa 0, ang `b` ay ituturing mas marami kaysa sa `a`. Ang resulta ay magiging 0 kung ito ay hindi isang numero, kung saan ang parehong element ay pantay."
        },
        "splice": {
            "desc": "Nagsisimula ito sa posisyon ng `simula`, tanggalin ang `bilang ng nabura` Ang elemento na galing sa talaan at ang dagdag na natitirang `gamit` sa position na ito. Ibalik ang tinanggal na mga elemento."
        },
        "split": {
            "desc": "Hatiin ang `teksto` sa pamamagitan ng `delimitro`. muling ibalik ang bagong talaan."
        },
        "unshift": {
            "desc": "Ipasok ang `halaga` sa simula ng talaan, at ibalik ang binagong talaan."
        }
    },
    "channel": {
        "id": {
            "desc": "Ibalik ang ID ng kasalukuyan o tinutukoy na channel."
        },
        "nsfw": {
            "desc": "Ibalik kahit ang kasalukuyan o ang tinutukoy na channel ay NSFW."
        },
        "name": {
            "desc": "Ibalik ang pangalan ng kasalukuyan o tinutukoy na channel."
        },
        "position": {
            "desc": "Ibalik ang posisyon ng kasalukuyan o tinutukoy na channel."
        },
        "topic": {
            "desc": "Ibalik ang kasalukuyang paksa o tinutukoy na channel (teksto lamang)."
        },
        "type": {
            "desc": "Ibalik ang uri ng kasalukuyan o tinutukoy na channel (ibalik ang \"teksto\" o \"boses\")."
        }
    },
    "general": {
        "clean": {
            "desc": "Linisin ang ibinigay na teksto sa pamamagitan ng pagurong sa lahat ng puting espasyo."
        },
        "comment": {
            "desc": "Tukuyin ang isang lugar na hindi pinapansin mula sa ginagawa"
        },
        "get": {
            "desc": "Ibalik ang mga nakaimbak na pagkakaiba kasama ang naibigay na pangalan. Ang pagkakaiba ng prefixes ay kayang bagohin ang tangke na kung saan ay naghahanap."
        },
        "set": {
            "desc": "Ibalik ang mga nakaimbak na pagkakaiba kasama ang naibigay na pangalan para sa ibinigay na halaga. Ang pagkakaiba ng prefixes ay kayang bagohin ang tangke na kung saan ay naghahanap."
        },
        "trim": {
            "desc": "Tanggalin ang puting espasyo bago at pagkatapos ng ibinigay na teksto. Isipin ang paggamit ng {clean} na tag para tanggalin ang puting espasyo sa loob ng teksto."
        },
        "void": {
            "desc": "Iwasan ang output mula sa loob ng subtag. I-differ mula sa pagpuna habang ang mga bagay ay ginagawa, ay hindi makita."
        },
        "newline": {
            "desc": "Ibalik ang tinutukoy na numero ng bagong mga linya, i-default sa 1."
        },
        "space": {
            "desc": "Ibalik ang tinutukoy na numero ng bagong mga linya, i-default sa 1."
        },
        "json": {
            "desc": ""
        }
    },
    "guild": {
        "createdat": {
            "desc": "Bumalik kung saan ang kasalukuyang kapisanan ay ginawa bilang isang Unix timestamp (milliseconds)."
        },
        "channels": {
            "desc": "Ibalik ang mga channel sa kasalukuyang kapisanan bilang isang talaan."
        },
        "icon": {
            "desc": "Ibalik ang URL ng kasalukuyang icon ng kapisanan."
        },
        "id": {
            "desc": "Ibalik ang ID ng kasalukuyang kapisanan."
        },
        "name": {
            "desc": "Ibalik ang pangalan ng kasalukuyang kapisanan."
        },
        "owner": {
            "desc": "Ibalik ang ID ng may ari ng kapisanan."
        },
        "region": {
            "desc": "Ibalik ang rehiyon ng kasalukuyang kapisanan kung nasaan sila galing."
        },
        "roles": {
            "desc": "Ibalik ang talaan ng mga tungkulin sa kasalukuyang kapisanan."
        }
    },
    "logic": {
        "if": {
            "desc": "Kung ang`halaga` ay katumbas ng `totoo` o `1`, paganahin ang `pagkatapos`. \nKung ang`halaga` ay katumbas ng `totoo` o `0`, paganahin ang `liban`. \nO kaya, magtapon ng error. \n\nGamitin ito kasama ng {logic} tag."
        },
        "logic": {
            "desc": "Ang mga lohikal na operator na`augend` at `operands`, ay magiging `true` o` false`.\n\nKatumbas na operator:\n - `==`- katumbas\n - `! =`- hindi magkatumbas\n - ` <`- mas mababa\n - `<=`- mas mababa o magkatumbas\n - `> `- mas mataas\n - `> =`- mas mataas o magkatumbas\n - `startswith` - ang augend ay nagsisimula kasama ang operand\n - `endwith` - ang augend ay nagtatapos kasama ang operand\n - `includes` - ang augend ay Kabilang dito ang operand\n\nLohikal na operator:\n - `&&`- ibalik ang totoo kung ang augend at operand ay parehong totoo\n - `||`- ibakik ang totoo kung alinman sa augend at operand ay totoo\n - `XOR`- ibalik ang totoo kung isa man sa augend at operand ay totoo (hindi parehong totoo)\n\nAng iba pang operatos:\n - `! `- baliktarin ang susunod na operand (ang totoo ay gawing hindi totoo, etc.)"
        }
    },
    "math": {
        "abs": {
            "desc": "Ibalik ang ganap na halaga ng binigay na numero (walang mga negatibo)."
        },
        "base": {
            "desc": "Gawin ang `numero` gamit ang binigay base sa `orihinal` (i-default ito sa 10), at ibahin ito sa base ng `radix`."
        },
        "ceil": {
            "desc": "Buoin ang ibinigay na decimal up."
        },
        "floor": {
            "desc": "Buoin ang ibinigay na decimal down."
        },
        "math": {
            "desc": "Ikalkula ang halaga ng ibinigay na pangungusap gamit ang mga sumusunod na operator:\n\n - `**` - exponent\n - `/` - dibisyon\n - `*` - multiplikasyon\n - `+` - pagdagdag\n - `-` - pagbabawas\n - `&` - bitwise AND\n - `|` - bitwise OR\n - `^` - bitwise XOR\n\nAng operator ay pinapagana gamit ang utos ng operasyong (Brackets, Exponent, Dibisyon, Mulitiplikasyon, pagdagdag, pagbabawas, Bitwise).\n\nKung ang isang operator ay hindi natukoy, ginamit nito ang huling ginamit ng operator (ang pagdagdag sa default).\n\nAng mga bracket ay makukuwa sa pamamagitan ng paggamit ng isa pang nested {math} tag.\n\nKung ang `operand` o `augend` hindi maaaring gawain ang isang numero, ang pagbabago kasama ang parehong pangalan ay makuha, Kung ang makukuhang pagbabago ay hindi rin numero, tanggalin ang error."
        },
        "parsefloat": {
            "desc": "Ang pagsubok para sa gagawin sa binigay na teksto bilang isang decimal."
        },
        "parseint": {
            "desc": "Ang pagsubok para sa gagawin sa binigay na teksto bilang isang integer."
        },
        "randint": {
            "desc": "Ibalik ang malayang integer sa pagitan ng binigay na layo. `min` i-default sa `0`"
        },
        "round": {
            "desc": "Buoin ang binigay na `numero` sa tinutukoy na decimal ng `place`, i-default ito sa 0."
        }
    },
    "message": {
        "id": {
            "desc": "Ibalik ang ID ng isinasagawang mensahe ng utos."
        }
    },
    "role": {
        "color": {
            "desc": "Ibalik ang kulay ng tinutukoy na pagganap sa hexadecimal."
        },
        "id": {
            "desc": "Ibalik ang ID ng tinutukoy na pagganap."
        },
        "mention": {
            "desc": "Ibalik ang pagbanggit sa tinutukoy na pagganap."
        },
        "name": {
            "desc": "Ibalik ang pangalan ng tinutukoy na pagganap."
        },
        "position": {
            "desc": "Ibalik ang posisyon ng tinutukoy na pagganap."
        }
    },
    "user": {
        "avatar": {
            "desc": "Ibalik ang URL ng avatar sa tinutukoy na gumagamit, i-default ito sa ginagawa ng gumagamit."
        },
        "createdat": {
            "desc": "Ibalik ang petsa ng tinutukoy na gumagamit, i-default ito sa ginagawa ng gumagamit, ito ay ginawa bilang timestamp ng unix (milliseconds)."
        },
        "discrim": {
            "desc": "Ibalik ang pagpipili ng tinutukoy na gumagamit, i-default ito sa ginagawa ng gumagamit."
        },
        "fullname": {
            "desc": "Ibalik ang pangalan ng + sa pagpipili ng tinutukoy na gumagamit, i-default ito sa ginagawa ng gumagamit."
        },
        "game": {
            "desc": "Ibalik ang nilalarong laro ng tinutukoy na gumagamit, i-default ito sa ginagawa ng gumagamit. Kung ang gumagamit ay hindi naglalaro ng isang laro, ibalik ito sa wala."
        },
        "id": {
            "desc": "Ibalik ang ID ng tinutukoy na gumagamit, i-default ang ginagawa ng gumagamit."
        },
        "joinedat": {
            "desc": "Ibalik ang petsa ng tinutukoy na gumagamit, i-default ito sa ginagawa ng gumagamit, sumali sa kasalukuyang kapisanan bilang isang timestamp ng unix (milliseconds)."
        },
        "mention": {
            "desc": "Banggitin ang tinutukoy na gumagamit, i-default ito sa ginagawa ng gumagamit."
        },
        "name": {
            "desc": "Ibalik ang pangalan ng tinutukoy na gumagamit, i-default ito sa ginagawa ng gumagamit."
        },
        "nick": {
            "desc": "Ibalik ang palayaw ng tinutukoy na gumagamit, i-default ito sa ginagawa ng gumagamit."
        },
        "roles": {
            "desc": "Ibalik ang talaan ng mga ginagampanan ng tinutukoy na gumagamit, i-default ito sa ginagawa ng gumagamit."
        },
        "setnick": {
            "desc": "Nagtatakda ng palayaw ng tinutukoy na user, nakadefault ito sa user na sumasagawa ng command."
        },
        "status": {
            "desc": "Ibinabalik ang kalagayan ng tinutukoy na user, nakadefault ito sa user na sumasagawa ng command. Maaaring ibalik ang \"online\", \"away\". \"dnd\", o \"offline\"."
        }
    }
}