{
    "array": {
        "filter": {
            "desc": "Gennemløber en matrix, hvis det aktuelle element til en lokal variabel \"i\". Hvis 'varName' er angivet, angiver denne variabel i stedet.\n\nReturnerer en ny matrix der kun indeholder elementer hvor resultatet af Iterationen var 'true' eller '1'."
        },
        "foreach": {
            "desc": "Gennemløber et array, hvis den lokale variabel `i` til det aktuelle element. Hvis `varName`, angiver denne variabel i stedet."
        },
        "get": {
            "desc": "Får et element fra en matrix på position 'index'."
        },
        "isarray": {
            "desc": "Returnerer true hvis det angivne element er et array, og false ellers. Du kan ikke bruge variabelnavne."
        },
        "join": {
            "desc": "Slutter et array med den medfølgende 'delimiter'."
        },
        "length": {
            "desc": "Returnerer længden af det givne array."
        },
        "map": {
            "desc": ""
        },
        "pop": {
            "desc": "Fjerner og retunerer det sidste element i arrayet."
        },
        "push": {
            "desc": "Skubber et element til slutningen af et array. Returnerer den modificerede matrix."
        },
        "set": {
            "desc": "Angiver et element i matrixen på det angivne `index`."
        },
        "shift": {
            "desc": "Fjerner og retunerer det første element i arrayet."
        },
        "slice": {
            "desc": "Returnerer en del af matrixen, inklusive `start` indeks og eksklusive `end` indeks. Hvis `end` er uspecificeret, resterende standarder for alle elementer."
        },
        "sort": {
            "desc": "Sorterer og returnerer et array, som standard i stigende rækkefølge.\n\nHvis `function` er angivet, vil sortering opstå baseret på resultatet af udførelsen af selvsamme funktion. Dette vil sætte to lokale variabler: `a` (eller `varNameOne`) og `b` (eller `varNameTwo`). \n\nFunktionen skal returnere et tal. Hvis tallet er større end 0, vil `a` anses for at være større end `b`. Hvis tallet er mindre end 0, vil `b` anses for at være større end `a`. Ethvert ikke-tal resultat vil blive konverteret til 0, hvor begge elementer er lige store."
        },
        "splice": {
            "desc": "Startende fra position 'start', fjerner 'deleteCount' elementer fra matrixen og tilføjer de resterende elementer i denne stilling. Returnerer de fjernede elementer."
        },
        "split": {
            "desc": "Splitter `teksten` ved `skilletegnet`, og returnerer det nye array."
        },
        "unshift": {
            "desc": "Indsætter 'værdi' i begyndelsen af matrixen og returnerer den modificerede matrix."
        }
    },
    "channel": {
        "id": {
            "desc": "Returnerer ID'et af den nuværende eller specifierede kanal."
        },
        "nsfw": {
            "desc": "Returner om kanalen er NSFW eller ej."
        },
        "name": {
            "desc": "Returnerer navnet på den aktuelle eller angivne kanal."
        },
        "position": {
            "desc": "Returnerer positionen for den aktuelle eller angivne kanal."
        },
        "topic": {
            "desc": "Returnerer emnet for den aktuelle eller angivne kanal (kun tekst)."
        },
        "type": {
            "desc": "Returnerer typen af den aktuelle eller angivne kanal (returnerer \"text\" eller \"voice\")."
        }
    },
    "general": {
        "clean": {
            "desc": "Renser det angivne tekst ved at skrumpe alle mellemrum."
        },
        "comment": {
            "desc": "Angiver et område der vil blive ignoreret fra parsing"
        },
        "get": {
            "desc": "Returnerer den gemte variabel med den medfølgende navn. Variabel fortegn kan ændre den pool hvor der skal søges."
        },
        "set": {
            "desc": "Indstiller variablen gemt med det angivne navn til den angivne værdi. Variabel præfikser kan ændre puljen til at indstille."
        },
        "trim": {
            "desc": "Fjerner mellemrum før og efter den angivne tekst. Overvej at bruge {clean} tagget for at fjerne mellemrum i teksten."
        },
        "void": {
            "desc": "Forhindrer output fra indenfor undertagget. Adskiller sig fra kommentar som ting er parset, bare ikke vises."
        },
        "newline": {
            "desc": "Returnerer det angivne antal newlines, misligholdende til 1."
        },
        "space": {
            "desc": "Returnerer det angivne antal mellemrum, standard er 1."
        }
    },
    "guild": {
        "createdat": {
            "desc": "Vender tilbage når den nuværende server blev oprettet som et Unix timestamp (millisekunder)."
        },
        "channels": {
            "desc": "Returnerer kanalerne i den nuværende server som en matrice."
        },
        "icon": {
            "desc": "Returnerer linket til ikonet for den nuværende server."
        },
        "id": {
            "desc": "Returnerer ID'ET på den nuværende server."
        },
        "name": {
            "desc": "Returnerer navnet på den aktuelle guild."
        },
        "owner": {
            "desc": "Returnerer ID'ET for serverens ejer."
        },
        "region": {
            "desc": "Returnerer den region som den nuværende server er placeret i."
        },
        "roles": {
            "desc": "Returnerer en matrix af roller i den aktuelle server."
        }
    },
    "logic": {
        "if": {
            "desc": "If the `value` is equal to `true` or `1`, executes `then`.\nIf the `value` is equal to `false` or `0`, executes `else`.\nOtherwise, throws an error.\n\nBrug dette med {logic} tagget."
        },
        "logic": {
            "desc": ""
        }
    },
    "math": {
        "abs": {
            "desc": "Returnerer den absolutte værdi af de angivne tal (ingen negativer)."
        },
        "base": {
            "desc": "Parserer `tallet` ved at bruge den angivne grundlæggende `oprindelse` (standard er 10), og konverterer det til `grundtal`."
        },
        "ceil": {
            "desc": "Runder den angivne decimale op."
        },
        "floor": {
            "desc": "Runder den angivne decimal ned."
        },
        "math": {
            "desc": "Udregner værdien af det angivne udtryk ved at bruge følgende operatorer:\n\n - `**`- eksponenter\n - `/` - division\n - `*` - multiplikation\n - `+` - addition\n - `-` - subtraktion\n - `&` - bitwise AND\n - `|` - bitwise OR\n _ `^` - bitwise XOR\n\nOperatorer udføres ud fra operatorenes rækkefølge (Parenteser, Eksponenter, Division, Multiplikation, Addition, Subtraktion, Bitwise).\n\nHvis en operator ikke er angivet, bruges den sidst-brugte operator (standard er addition).\n\nParenteser kan opnås ved at bruge endnu et indlejret {math} tag.\n\nHvis en `operand` eller `augend` ikke kan blive parset som et tal, vil en vaiable med det samme navn blive hentet. Hvis den hentede variabel heller ikke er et tal, vil der opstå en fejl."
        },
        "parsefloat": {
            "desc": "Forsøger at parse det angivne tekst som et decimal."
        },
        "parseint": {
            "desc": "Forsøger at parse det angivne tekst som et heltal."
        },
        "randint": {
            "desc": "Returnerer et tilfældigt heltal i den angivne rækkevidde. `min` er som udgangspunkt sat til at være `0`"
        },
        "round": {
            "desc": "Afrunder det givne `tal` til det angivne decimal `pladser`, som standard sat til 0."
        }
    },
    "message": {
        "id": {
            "desc": "Returnerer ID af beskeden med den udførte kommando."
        }
    },
    "role": {
        "color": {
            "desc": "Returnerer farven af den angivne rolle i hexadecimal."
        },
        "id": {
            "desc": "Returnerer ID'ET for den angivne rolle."
        },
        "mention": {
            "desc": "Returnerer en omtale af den angivne rolle."
        },
        "name": {
            "desc": "Returnerer navnet på den angivne rolle."
        },
        "position": {
            "desc": "Returnerer placeringen af en bestemt rolle."
        }
    },
    "user": {
        "avatar": {
            "desc": "Returnerer navnet på den specifikke bruger, som standard sat til den udøvende bruger."
        },
        "createdat": {
            "desc": "Returnerer datoen som den angivne bruger, som standard sat til at være den udøvende bruger, oprettede sig som et Unix tidsstempel (millisekunder)."
        },
        "discrim": {
            "desc": "Returnerer diskrimanotoren af en specificeret bruger,"
        },
        "fullname": {
            "desc": "Returnerer navnet + diskrimanotoren af en specificeret bruger, som standard sat til at være den udøvende bruger."
        },
        "game": {
            "desc": "Returnerer spillet den angivne bruger spiller, standard er den udøvende bruger. Hvis brugeren ikke spiller et spil, returnerer ingenting."
        },
        "id": {
            "desc": "Returnerer ID'et for den specifikke bruger, standard til den udøvende bruger."
        },
        "joinedat": {
            "desc": "Returnerer datoen som den angivne bruger, som standard sat til at være den udøvende bruger, tilsluttede sig serveren som et Unix tidsstempel (millisekunder)."
        },
        "mention": {
            "desc": "Nævner den angivne bruger, misligholdende til den fuldbyrdende bruger."
        },
        "name": {
            "desc": "Returnerer navnet på den specifikke bruger, som standard sat til den udøvende bruger."
        },
        "nick": {
            "desc": "Returnerer kaldenavnet på den angivne bruger, misligholdende til den fuldbyrdende bruger."
        },
        "roles": {
            "desc": "Returner et array der indeholder de roller den angivne bruger har, som standard sat til den udøvende bruger."
        },
        "setnick": {
            "desc": "Angiver kaldenavnet på den angivne bruger, misligholdende til den fuldbyrdende bruger."
        },
        "status": {
            "desc": "Returnerer status for den angivne bruger, som standard sat til den udførende bruger. Kan returnere \"online\", \"away\", \"dnd\" eller \"offline\"."
        }
    }
}