{
  "language":"Dansk",
  "header":{
    "login":"Log på",
    "logout":"Log af",
    "commands":"Kommandoer",
    "bbtag":"BBTag",
    "subtags":"SubTags"
  },
  "index":{
    "desc":"blargbot er en multifunktionel Discord bot dedikeret til at levere kvalitets kommandoer og tjenester, herunder chatlogs og et dybdegående brugerdefinerede kommando system.",
    "commands":{
      "title":"Kommandoer",
      "desc":"blargbot er udstyret med talrige kommandoer, som alle er dokumenteret og kategoriseret for din bekvemmelighed."
    },
    "bbtag":{
      "title":"BBTag",
      "desc":"blargbot bruger et sofistikeret tag system kaldet BBTag, som du kan bruge til at oprette avancerede brugerdefinerede kommandoer."
    },
    "customization":{
      "title":"Tilpasning",
      "desc":"Vi forstår, at ikke alle servere er ens, så blargbot har omfattende tilpasning. Du kan styre, nøjagtigt hvilke roller kan bruge hvilke kommandoer, angive brugerdefinerede fortegn, og endda ændre grænsefladesproget!"
    },
    "moderation":{
      "title":"Moderation",
      "desc":"Brug for noget til at overvåge din chat? blargbot er udstyret med mange moderation hjælpeværktøjer, fra grundlæggende operationer som udelukkelse og muting, til mere avancerede ting som chatlogging eller automatiske censur."
    },
    "opensource":{
      "title":"Open Source",
      "desc":"Deling er omsorgsfulde! blargbot er helt open source under licensen GNU AGPLv3. Du er velkommen til at tage et kig og lær hvordan det hele fungerer. Hvis du bruger noget af min kode i dit eget projekt, er du forpligtet til at angive mig som kilde. Se licens for flere detaljer."
    },
    "suggestions":{
      "title":"Åben for forslag",
      "desc":"Har et forslag til botten? Jeg vil være glad for at høre det! Fundet en fejl? Jeg vil gerne høre der også! Du kan foreslå noget for mig ved hjælp af kommandoen `suggest`, ved at tilslutte min server, eller ved at indsende en anmodning om support."
    }
  },
  "bbtag":"# BBTag\n> Ikke at forveksle med BBCode!\n\nBBTag er et skabelon-baseret programmeringssprog, der er designet til at give en kraftfuld ramme for skabelse af avancerede brugerdefinerede kommandoer.\n\n## Termer\n- Et `tag` henviser til en blok af BBTag kode, uanset om det er et offentligt tag eller en brugerdefineret kommando.\n- Et `subtag` henviser til et BBTag komponent. Avancerede `tags` er lavet af mange `subtags`.\n- En `class`henvise til en gruppe af `subtags`.\n\n## SubTags\n\nSubtags er de basale byggesten af BBTag. De udfører dynamiske funktioner, uanset om det er at få navnet på en bruger eller om det er at udføre matematiske regnestykker. Lad os nu tage et kig på et subtag:\n```\n{math.randint;1;10}\n```\nNår udført, kan det returnere følgende:\n```\n6\n```\nSom du kan se, returner `math.randint` subtagget et tilfældigt heltal indenfor de angivne rammer."
}